Rails/CatsAPI/app/views/cats/show.html.erb

    </div>
    <%@cat.toys.each do |toy|%>
---
SELECT "toys".* FROM "toys" WHERE "toys"."cat_id" = $1  [["cat_id", 1]]