SQL/Active_Record/URLShortener/app/models/shortened_url.rb

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "9c2xUP4Q8Uf5dnQxzFdvWg"], ["LIMIT", 1]]
---
            def self.random_code
                    short=nil
                    while short==nil || ShortenedUrl.exists?(short_url: short)

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.google.com"], ["short_url", "9c2xUP4Q8Uf5dnQxzFdvWg"], ["user_id", 11], ["created_at", "2020-05-10 14:24:38.155522"], ["updated_at", "2020-05-10 14:24:38.155522"]]
---
            def self.create_shortened_url!(user,long_url)