Rails/Rentanimals/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @all=Cat.all

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 333], ["LIMIT", 1]]
---
    def edit
       @cat=Cat.find(params[:id])

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "M"], ["description", "fddsfdsfsdfsdfsdfsd"], ["updated_at", "2020-06-23 20:13:07.767688"], ["id", 1]]
---
    def update
        @cat=Cat.find(params[:id])
        if @cat.update_attributes(cats_params)

INSERT INTO "cats" ("name", "sex", "description", "birth_date", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cats_params)
        if @cat.save

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
        @cat=Cat.find(params[:id])