Rails/CatsAPI/app/controllers/toys_controller.rb

    def index
    @cat=Cat.find(params[:cat_id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def new
        @cat=Cat.find(params[:cat_id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
     @toy=Toy.find(params[:id])
---
SELECT "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
     puts "=================================="
     puts params[:cat_id]

     puts "=============================="
        @cat=Cat.find(params[:cat_id])
        @toy=@cat.toys.create(toy_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "toys" ("name", "ttype", "cat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "oyuncakkkkk"], ["ttype", "dnsadsdsadnuısahduıhv uydhsabnch dnbnbhasdncasda"], ["cat_id", 1], ["created_at", "2020-05-24 23:26:06.705042"], ["updated_at", "2020-05-24 23:26:06.705042"]]